# Entry 20 notebook: Shortest Path

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use('ggplot')
%matplotlib inline

import warnings
warnings.filterwarnings('once')

from neo4j import GraphDatabase

In [2]:
uri = "bolt://localhost:7687"

driver = GraphDatabase.driver(uri, auth=('neo4j', 'password'))

uni_session = driver.session(database="unimodal")

C:\Users\jfish\anaconda3\lib\site-packages\ipykernel\ipkernel.py:287: DeprecationWarning: `should_run_async` will not call `transform_cell` automatically in the future. Please pass the result to `transformed_cell` argument and any exception that happen during thetransform in `preprocessing_exc_tuple` in IPython 7.17 and above.
  and should_run_async(code)

In [7]:
shortest_path = pd.DataFrame(uni_session.run('''MATCH (h:Hero)
    call apoc.path.spanningTree(h, {labelFilter:'/Villain', minLevel:1, limit: 1})
    YIELD path
    RETURN h.name as name, labels(h)[-1] as type, length(path) as min_distance''').data())

In [8]:
shortest_path

                      name     type  min_distance
0     24-HOUR MAN/EMMANUEL     Hero             2
1     3-D MAN/CHARLES CHAN     Hero             1
2         4-D MAN/MERCURIO  Villain             1
3                  8-BALL/     Hero             2
4             ABBOTT, JACK     Hero             1
...                    ...      ...           ...
6398           ZOTA, CARLO     Hero             1
6399                  ZOTA     Hero             1
6400                 ZURAS     Hero             1
6401                  ZURI     Hero             1
6402                 ZZZAX  Villain             1

[6403 rows x 3 columns]

In [13]:
shortest_path[shortest_path['min_distance'] == shortest_path['min_distance'].max()]

                      name  type  min_distance
25          ADAMSON, JASON  Hero             3
26        ADAMSON, REBECCA  Hero             3
301               AZOPARDI  Hero             3
858          CAPTAIN GLORY  Hero             3
3210          LOGAN, WAYNE  Hero             3
3452  MARVEL BOY VIII/NOH-  Hero             3
3595                MERREE  Hero             3
4065            OUBLIETTE/  Hero             3
4244     PLEX INTELLIGENCE  Hero             3